In [9]:
print(123)
b = 456
print(c)

123
789

In [6]:
print(a)

123

In [7]:
print(b)

456

In [8]:
c = 789

In [12]:
a
b
c
print(a)

a

123

123

# Practice Pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(columns=["Name", "Age", "Height"])
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [3]:
df.loc[0] = ["Allen", 22, 175]

In [4]:
df

    Name  Age  Height
0  Allen   22     175

In [5]:
df.loc[1] = ["Jack", 25, 180]
df.loc[2] = ["Mike", 28, 170]
df

    Name  Age  Height
0  Allen   22     175
1   Jack   25     180
2   Mike   28     170

In [6]:
df["Weight"] = [80, 75, 88]
df

    Name  Age  Height  Weight
0  Allen   22     175      80
1   Jack   25     180      75
2   Mike   28     170      88

In [7]:
df.drop("Weight", axis=1)

    Name  Age  Height
0  Allen   22     175
1   Jack   25     180
2   Mike   28     170

In [8]:
df = df.drop("Weight", axis=1)
df

    Name  Age  Height
0  Allen   22     175
1   Jack   25     180
2   Mike   28     170

In [9]:
df.drop(["Name", "Age"], axis=1)

   Height
0     175
1     180
2     170

In [10]:
df.drop(2)

    Name  Age  Height
0  Allen   22     175
1   Jack   25     180

In [11]:
df

    Name  Age  Height
0  Allen   22     175
1   Jack   25     180
2   Mike   28     170

In [12]:
df["Height"].loc[1]

np.int64(180)

In [13]:
df["Height"].loc[1] = 177

/var/folders/_k/k5dry95j0q5d35_9pn5d86vm0000gn/T/ipykernel_71200/366385581.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df["Height"].loc[1] = 177
/var/folders/_k/k5dry95j0q5d35_9pn5d86vm0000gn/T/ipykernel_71200/366385581.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Height"].loc[1] = 177

In [14]:
df

    Name  Age  Height
0  Allen   22     175
1   Jack   25     177
2   Mike   28     170

In [15]:
df.loc[1, "Height"]

np.int64(177)

In [16]:
df.loc[:, "Height"] = 179

In [17]:
df.loc[[0, 2], "Height"]

0    179
2    179
Name: Height, dtype: int64

In [18]:
df.loc[[0, 2], ["Height", "Name"]]

   Height   Name
0     179  Allen
2     179   Mike

In [19]:
df["Age"]

0    22
1    25
2    28
Name: Age, dtype: int64

In [20]:
type(df["Age"])

pandas.core.series.Series

In [21]:
type(df)

pandas.core.frame.DataFrame

In [22]:
data = [
    ["Trump", 22, 175],
    ["Terry", 25, 180],
]
columns = ["Name", "Age", "Height"]

df2 = pd.DataFrame(data=data, columns=columns)

df2

    Name  Age  Height
0  Trump   22     175
1  Terry   25     180

In [23]:
pd.concat(
    [df, df2]
)

    Name  Age  Height
0  Allen   22     179
1   Jack   25     179
2   Mike   28     179
0  Trump   22     175
1  Terry   25     180

In [24]:
df2["Weight"] = 70
df2

    Name  Age  Height  Weight
0  Trump   22     175      70
1  Terry   25     180      70

In [25]:
pd.concat(
    [df, df2]
)

    Name  Age  Height  Weight
0  Allen   22     179     NaN
1   Jack   25     179     NaN
2   Mike   28     179     NaN
0  Trump   22     175    70.0
1  Terry   25     180    70.0

In [26]:
pd.concat(
    [
        df[["Name", "Height", "Age"]],
        df2[["Name", "Age", "Height", "Weight"]],
    ]
)

    Name  Height  Age  Weight
0  Allen     179   22     NaN
1   Jack     179   25     NaN
2   Mike     179   28     NaN
0  Trump     175   22    70.0
1  Terry     180   25    70.0

In [27]:
df[["Name", "Height"]]

    Name  Height
0  Allen     179
1   Jack     179
2   Mike     179

In [28]:
pd.concat(
    [
        df[["Name", "Height", "Age"]],
        df2[["Name", "Age", "Height", "Weight"]],
    ]
).reset_index(drop=True)

    Name  Height  Age  Weight
0  Allen     179   22     NaN
1   Jack     179   25     NaN
2   Mike     179   28     NaN
3  Trump     175   22    70.0
4  Terry     180   25    70.0

In [29]:
df

    Name  Age  Height
0  Allen   22     179
1   Jack   25     179
2   Mike   28     179

In [30]:
df_tmp = df

In [31]:
df_tmp

    Name  Age  Height
0  Allen   22     179
1   Jack   25     179
2   Mike   28     179

In [32]:
df_tmp["Height"] = 188
df_tmp

    Name  Age  Height
0  Allen   22     188
1   Jack   25     188
2   Mike   28     188

In [33]:
df

    Name  Age  Height
0  Allen   22     188
1   Jack   25     188
2   Mike   28     188

In [34]:
df_tmp = df.copy()

In [35]:
df_tmp["Height"] = 190
df_tmp

    Name  Age  Height
0  Allen   22     190
1   Jack   25     190
2   Mike   28     190

In [36]:
df

    Name  Age  Height
0  Allen   22     188
1   Jack   25     188
2   Mike   28     188

In [37]:
df_final = pd.concat(
    [
        df[["Name", "Height", "Age"]],
        df2[["Name", "Age", "Height", "Weight"]],
    ]
).reset_index(drop=True)
df_final

    Name  Height  Age  Weight
0  Allen     188   22     NaN
1   Jack     188   25     NaN
2   Mike     188   28     NaN
3  Trump     175   22    70.0
4  Terry     180   25    70.0

In [38]:
df_final.to_csv(
    "pandas_practice.csv",
    index=0,
)

In [39]:
df_final.to_csv(
    "pandas_practice_no_col.csv",
    index=0,
    header=None,
)

In [40]:
df_read = pd.read_csv("pandas_practice.csv")
df_read

    Name  Height  Age  Weight
0  Allen     188   22     NaN
1   Jack     188   25     NaN
2   Mike     188   28     NaN
3  Trump     175   22    70.0
4  Terry     180   25    70.0

In [41]:
df_read = pd.read_csv(
    "pandas_practice_no_col.csv",
    header=None,
)
df_read.columns = columns + ["Weight"]
df_read

    Name  Age  Height  Weight
0  Allen  188      22     NaN
1   Jack  188      25     NaN
2   Mike  188      28     NaN
3  Trump  175      22    70.0
4  Terry  180      25    70.0